---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Events.MessageBoxData
source: html/6eb620e6-2948-27ab-4118-3cd542a052ca.htm
---
# MessageBoxData Members

Causes the object to release immediately any resources it may be utilizing.